InformationRegisters/ОперацииПроверкиКМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОперацииПроверкиКМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗапросКодаМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверкиКМНаККТ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверкиКМНаСервере</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагиПроверкиОИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПокупкаПодтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервераЗапросаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапросаРазрешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтветаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатЗапросаРазрешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапросаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЗапросаРазрешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСессии</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФискальнойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФискальныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФискальныеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФискальныхДокументовККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальныйПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаНаличные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЭлектронно</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПостоплата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПредоплата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВстречноеПредоставление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСайтаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаводскойНомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеФискальнойОперацииБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубъектПерсональныхДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектПерсональныхДанныхБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиныйЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОплатыПлатежнойСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлатежнойСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежнойСистемыККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеФискальнойОперацииБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОперацииПроверкиКМ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаПроверкиСведенийОТовареПФ = МенеджерОборудованияМаркировка.ТаблицаПроверкиСведенийОТовареПФ();
	ТаблицаПроверкиСведенийОТоваре = МенеджерОборудованияМаркировка.ТаблицаПроверкиСведенийОТоваре();
	МассивШтрихкодов = Новый Массив();
	Если Не ПустаяСтрока(Запись.ФлагиПроверкиОИСМ) Тогда
		РезультатПроверки = ТаблицаПроверкиСведенийОТовареПФ[Запись.ФлагиПроверкиОИСМ];
		Элементы.РезультатПроверкиОписание.Заголовок = ТаблицаПроверкиСведенийОТоваре[Запись.ФлагиПроверкиОИСМ];
	Иначе
		Элементы.РезультатПроверки.Видимость = Ложь;
		Элементы.РезультатПроверкиОписание.Видимость = Ложь;
	КонецЕсли;
	
	Результат = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Запись.КодМаркировки, Истина);
	Если Результат.Разобран Тогда
		ТипКода = Результат.ТипИдентификатораТовара;
		КодМаркировкиПредставление = Результат.ПредставлениеШтрихкода;
		Штрихкод = Результат.GTIN;
	Иначе
		ТипКода = Результат.ТипИдентификатораТовара;
		КодМаркировкиПредставление = Запись.КодМаркировки;
		Штрихкод = Запись.КодМаркировки;
	КонецЕсли;
	
	МассивШтрихкодов.Добавить(Штрихкод);
	
	Элементы.РезультатПодтверждениеПокупки.Видимость = Не Запись.ПокупкаПодтверждена;
	
	УстановитьДанныеИхХранилищаЗначений();
	
	Элементы.ФормаСообщениеВТехПоддержку.Видимость = ОбщегоНазначенияБПО.ИспользуетсяСообщенияВСлужбуТехническойПоддержки()
			И ОбщегоНазначенияБПОСлужебныйВызовСервера.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
			
	Элементы.КодОтветаПредставление.Заголовок = КодОтветаГИСМТПредставление(Запись.КодОтветаРазрешения);
	
	РезультатПроверкиРР = РезультатПроверкиРазрешительногоРежима(Запись.КодОтветаРазрешения);
	
	Если КодОтветаАварийнаяСитуация(Запись.КодОтветаРазрешения) Тогда
		Элементы.ГруппаЗапросРазрешения.Видимость = Ложь;
		Элементы.ГруппаИдентификатор.Видимость = Ложь;
		Элементы.ГруппаРезультатЗапросаРазрешения.Видимость = Ложь;
		Элементы.ДекорацияИнформация.Видимость = Истина;
		Элементы.ДекорацияИнформация.Заголовок = НСтр("ru = 'Продажа разрешена в рамках аварийного режима.'");
	Иначе
		Элементы.ГруппаЗапросРазрешения.Видимость = Истина;
		Элементы.ГруппаИдентификатор.Видимость = Истина;
		Элементы.ГруппаРезультатЗапросаРазрешения.Видимость = Истина;
		Элементы.ДекорацияИнформация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяСообщенияВСлужбуТехническойПоддержки() Тогда
		МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
		Элементы.ФормаСообщениеВТехПоддержку.Видимость
			= МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ОтправлятьСообщенияВТехПоддержку();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СообщениеВТехПоддержку(Команда)
	
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
	ПараметрыСообщения = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПараметрыОтправкиСообщенияОбОшибке();
	ПараметрыСообщения.ДополнительныеДанные = СведенияДляТехподдержки();
	
	
	ПараметрыСообщения.ТекстОшибки = НСтр("ru = 'Информация о проверке контрольной марки для тех.поддержки'");
	ОписаниеОповещения = Новый ОписаниеОповещения("СообщениеВТехническуюПоддержкуЗавершение", ЭтотОбъект);
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.НачатьОтправкуСообщенияОбОшибке(ОписаниеОповещения, ПараметрыСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СведенияДляТехподдержки()
	
	Результат = Новый Структура();
	Для каждого Измерение Из Метаданные.РегистрыСведений.ОперацииПроверкиКМ.Измерения Цикл
		Значение = Запись[Измерение.Имя];
		Результат.Вставить(Измерение.Имя, Значение);
	КонецЦикла;
	Для каждого Ресурс Из Метаданные.РегистрыСведений.ОперацииПроверкиКМ.Ресурсы Цикл
		Если Ресурс.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		Значение = Запись[Ресурс.Имя];
		Результат.Вставить(Ресурс.Имя, Значение);
	КонецЦикла;
	Для каждого Реквизит Из Метаданные.РегистрыСведений.ОперацииПроверкиКМ.Реквизиты Цикл
		Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		Значение = Запись[Реквизит.Имя];
		Результат.Вставить(Измерение.Имя, Значение);
	КонецЦикла;
	Результат.Вставить("ЗапросКодаМаркировки", ЗапросКМ);
	Результат.Вставить("РезультатПроверкиКМНаККТ", РезультатПроверкиНаККТ);
	Результат.Вставить("РезультатПроверкиКМНаСервере", РезультатПроверкиНаСервере);
	Результат.Вставить("РезультатЗапросаРазрешения", РезультатЗапросаРазрешения);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьДанныеИхХранилищаЗначений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииПроверкиКМ.ЗапросКодаМаркировки КАК ЗапросКодаМаркировки,
		|	ОперацииПроверкиКМ.РезультатПроверкиКМНаККТ КАК РезультатПроверкиКМНаККТ,
		|	ОперацииПроверкиКМ.РезультатПроверкиКМНаСервере КАК РезультатПроверкиКМНаСервере,
		|	ФискальныеОперации.ДокументОснование КАК ДокументОснование,
		|	ФискальныеОперации.Дата КАК Дата,
		|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧекаККМ,
		|	ОперацииПроверкиКМ.РезультатЗапросаРазрешения КАК РезультатЗапросаРазрешения,
		|	ОперацииПроверкиКМ.ТекстЗапросаРазрешения КАК ТекстЗапросаРазрешения
		|ИЗ
		|	РегистрСведений.ОперацииПроверкиКМ КАК ОперацииПроверкиКМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|		ПО ОперацииПроверкиКМ.ИдентификаторФискальнойОперации = ФискальныеОперации.ИдентификаторЗаписи
		|ГДЕ
		|	ОперацииПроверкиКМ.ИдентификаторСессии = &ИдентификаторСессии
		|	И ОперацииПроверкиКМ.ИдентификаторЗапроса = &ИдентификаторЗапроса";
	
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", Запись.ИдентификаторЗапроса);
	Запрос.УстановитьПараметр("ИдентификаторСессии", Запись.ИдентификаторСессии);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЗапросКМ = Выборка.ЗапросКодаМаркировки.Получить();
	РезультатПроверкиНаККТ = Выборка.РезультатПроверкиКМНаККТ.Получить();
	РезультатПроверкиНаСервере = Выборка.РезультатПроверкиКМНаСервере.Получить();
	РезультатЗапросаРазрешения = Выборка.РезультатЗапросаРазрешения.Получить();
	ТекстЗапросаРазрешения = Выборка.ТекстЗапросаРазрешения.Получить();
	ДокументОснование = Выборка.ДокументОснование;
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Элементы.ДокументОснование.Видимость = Ложь;
	КонецЕсли;
	ФискальнаяОперация = Запись.ИдентификаторФискальнойОперации;
	Если ЗначениеЗаполнено(Выборка.Дата) Тогда
		ФискальнаяОперацияПредставление = 
			СтрШаблон(НСтр("ru = '%1 от %2'"), Выборка.НомерЧекаККМ, Формат(Выборка.Дата, НСтр("ru = 'ДЛФ=DT'")));
	Иначе
		Элементы.ФискальнаяОперацияПредставление.Видимость = Ложь;
	КонецЕсли;

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючФискальнойОперации(ИдентификаторЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ФискальныеОперации.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|ГДЕ
		|	ФискальныеОперации.ИдентификаторЗаписи = &ИдентификаторЗаписи";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", ИдентификаторЗаписи);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	Ключ = Новый Структура();
	Ключ.Вставить("ДокументОснование", Выборка.ДокументОснование);
	Ключ.Вставить("ИдентификаторЗаписи", ИдентификаторЗаписи);
	Возврат РегистрыСведений.ФискальныеОперации.СоздатьКлючЗаписи(Ключ);
	
КонецФункции

&НаКлиенте
Процедура ФискальнаяОперацияПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	Ключ = КлючФискальнойОперации(Запись.ИдентификаторФискальнойОперации);
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Ключ) Тогда
		ОткрытьФорму("РегистрСведений.ФискальныеОперации.ФормаЗаписи", Новый Структура("Ключ", Ключ));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщениеВТехническуюПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ПустаяСтрока(Результат.КодОшибки) Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция КодОтветаГИСМТПредставление(КодОтвета)
	
	ТаблицаРезультатов = Новый Соответствие();
	ТаблицаРезультатов.Вставить(Неопределено, "");  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("", "");  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить(НСтр("ru = 'Таймаут'"), "");  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("200", НСтр("ru = 'Успешно'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("401", НСтр("ru = 'Ошибка авторизации'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("203", НСтр("ru = 'Аварийная ситуация'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("429", НСтр("ru = 'Не доступна'"));  //@NON-NLS-1 @NON-NLS-2
	КодОтветаПредставление = ТаблицаРезультатов[КодОтвета];
	Если КодОтветаПредставление = Неопределено Тогда
		КодОтветаПредставление = НСтр("ru = 'Ошибка'")
	КонецЕсли;
	Возврат КодОтветаПредставление;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодОтветаАварийнаяСитуация(КодОтвета)
	Возврат КодОтвета = "203";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РезультатПроверкиРазрешительногоРежима(КодОтвета)
	
	Если КодОтвета = Неопределено 
		Или ВРег(КодОтвета) = ВРег(НСтр("ru = 'Таймаут'")) 
		Или КодОтветаАварийнаяСитуация(КодОтвета) Тогда
		Возврат НСтр("ru = 'Проверка не пройдена, продажа разрешена.'");
	ИначеЕсли СтрНачинаетсяС(КодОтвета, "2") Тогда
		Возврат НСтр("ru = 'Проверка пройдена, продажа разрешена.'");
	ИначеЕсли ПустаяСтрока(КодОтвета) Тогда
		Возврат НСтр("ru = 'Не выполнялось.'");
	Иначе
		Возврат НСтр("ru = 'Проверка не пройдена, продажа запрещена.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
